{
  "project_summary": "This project is a codebase analysis tool that generates summaries of code files, folders, and entire projects. It offers two primary user interfaces: a command-line interface (`cli.py`) and a Streamlit-based web application (`web_app.py`).\n\n**Overall Purpose:**\nThe tool's main purpose is to analyze a given project's codebase, identify key components, understand its structure and workflow, and produce a comprehensive summary. This summary can be used to quickly grasp the project's functionality and organization.\n\n**Main Workflow (Entrypoints → Modules → Data Flow):**\n\n1.  **Entrypoints:**\n    *   `cli.py`: Users provide a project path via the command line.\n    *   `web_app.py`: Users interact with a web interface to input a project path.\n\n2.  **Core Logic (`src` folder):**\n    *   **Configuration:** `src/config.py` loads necessary settings, likely including API keys.\n    *   **File Discovery:** `src/file_scanner.py` identifies relevant code files within the specified project path, excluding certain directories.\n    *   **File Summarization:** The `src/summarizer.py` module reads individual code files, and using `src/llm_client.py` to interact with a generative AI model, generates summaries for each file.\n    *   **Folder Aggregation:** `src/folder_aggregator.py` takes individual file summaries and aggregates them into summaries for their respective parent folders. This module also handles text chunking for processing.\n    *   **Workflow and Project Analysis:** `src/workflow_analyzer.py` performs deeper analysis, including identifying entry points, important modules, building dependency graphs, and potentially estimating API costs.\n    *   **Project-Level Orchestration:** The `src/summarizer.py` module orchestrates the entire summarization process, combining file and folder summaries, and integrating the results from the workflow analyzer.\n    *   **README Generation:** `src/generate_readme.py` formats the final analysis results into a `README.md` file.\n\n3.  **Data Flow:**\n    *   Input project path.\n    *   List of code files identified by `src/file_scanner.py`.\n    *   Individual file content.\n    *   Summaries of individual files (generated by `src/llm_client.py` via `src/summarizer.py`).\n    *   Aggregated folder summaries (generated by `src/folder_aggregator.py`).\n    *   Workflow analysis results (entry points, important modules, dependency graphs) from `src/workflow_analyzer.py`.\n    *   A consolidated project summary structure.\n    *   Output: A generated `README.md` file.\n\n**Architecture Patterns:**\nThe project follows a layered architecture, with distinct responsibilities for user interaction, core logic, and external service (LLM) interaction. It appears to be an orchestrated process where modules call each other to achieve a larger goal.\n\n**Key Components:**\n\n*   **`src/config.py`**: Manages application configuration.\n*   **`src/file_scanner.py`**: Discovers code files.\n*   **`src/llm_client.py`**: Interacts with a generative AI model for summarization.\n*   **`src/summarizer.py`**: Orchestrates file and project summarization.\n*   **`src/folder_aggregator.py`**: Aggregates file summaries into folder summaries.\n*   **`src/workflow_analyzer.py`**: Analyzes code structure, workflow, and dependencies.\n*   **`src/generate_readme.py`**: Formats the final output into a README file.\n*   **`cli.py`**: Provides a command-line interface.\n*   **`web_app.py`**: Provides a web-based interface using Streamlit.",
  "files": {
    "cli.py": "The file `cli.py` implements a command-line interface (CLI) for a codebase summarizer.\n\nIt uses the `argparse` module to handle command-line arguments. The CLI expects one positional argument:\n- `path`: The path to the project root directory that needs to be summarized.\n\nIt also accepts an optional argument:\n- `--out`: The path to the output JSON file where the summaries will be saved. If not provided, it defaults to `code_summary.json`.\n\nThe `main` function:\n1. Parses the command-line arguments.\n2. Resolves the provided project path to an absolute path.\n3. Checks if the project path exists; if not, it exits with an error.\n4. Prints a message indicating the start of the summarization process.\n5. Calls the `summarize_project` function (imported from `src.summarizer`), passing the project root path as a string.\n6. Resolves the output file path to an absolute path.\n7. Opens the output file in write mode with UTF-8 encoding.\n8. Uses `json.dump` to write the result of `summarize_project` to the output file in JSON format with an indent of 2 spaces.\n9. Prints a message indicating where the summary has been written.\n\nThe script executes the `main` function when run directly.",
    "web_app.py": "The `web_app.py` file implements a Streamlit web application for analyzing and visualizing Python codebases.\n\nThe application provides the following functionalities:\n\n*   **Project Path Configuration**: Allows users to input the path to their project directory.\n*   **Cost Prediction**: Estimates the cost of using an AI API based on the number of files in the project.\n*   **Codebase Analysis Trigger**: A button to initiate the analysis of the selected codebase.\n*   **Output Saving**: Automatically saves the analysis results to a `code_summary.json` file in the project root.\n*   **README Generation**: Provides a button to download a generated `README.md` file based on the analysis.\n*   **Tabbed Interface**: Organizes the output into three tabs:\n    *   **Project Overview**: Displays a summary of the project, detected entry points, and top modules by importance.\n    *   **Folder Structure**: Shows a hierarchical view of folders and files with their respective summaries.\n    *   **Workflow Graph**: Renders an interactive graph visualizing the dependencies and structure of the codebase. The nodes in the graph are colored based on the programming language, and entry points are highlighted.\n\nThe application uses external modules `src.file_scanner` and `src.summarizer` for file listing and project summarization, respectively, and `streamlit_agraph` for rendering the interactive graph.\n\nThe `main` function orchestrates the Streamlit app's layout and functionality. It includes a sidebar for configuration and a main area with tabs for displaying the analysis results.",
    "src\\config.py": "The `config.py` file is responsible for loading and managing configuration settings.\n\nIt imports the `os` module for interacting with the operating system and `load_dotenv` from the `dotenv` library to load environment variables from a `.env` file.\n\nThe file attempts to load the `GEMINI_API_KEY` and `GEMINI_MODEL` from environment variables.\n- If `GEMINI_API_KEY` is not found in the environment, it raises a `RuntimeError`.\n- `GEMINI_MODEL` is loaded from the environment, with a default value of `\"gemini-2.5-flash\"` if not found.",
    "src\\file_scanner.py": "The `file_scanner.py` file provides functionality to identify and list code files within a given directory.\n\nIt defines:\n- `CODE_EXTENSIONS`: A set of file extensions considered to be code files.\n- `IGNORE_DIRS`: A set of directory names to be ignored during the scan.\n\nThe file contains two functions:\n- `is_code_file(filename: str) -> bool`: Checks if a given filename has an extension present in `CODE_EXTENSIONS`.\n- `list_code_files(root_path: str) -> List[str]`:\n    - Recursively walks through the directory specified by `root_path`.\n    - Prunes directories listed in `IGNORE_DIRS` from the traversal.\n    - For each file encountered, it checks if it's a code file using `is_code_file`.\n    - If it's a code file, its full path is added to a list.\n    - Returns a list of full paths to all identified code files.",
    "src\\folder_aggregator.py": "The `folder_aggregator.py` file contains functions for aggregating summaries of files into summaries for their parent folders.\n\n- `_chunk_text(text: str, max_chars: int = MAX_FOLDER_SUMMARY_CHARS) -> List[str]`: This helper function splits a given `text` into a list of smaller strings (chunks), each not exceeding `max_chars`. The default `max_chars` is set by `MAX_FOLDER_SUMMARY_CHARS` to 4000.\n\n- `aggregate_folder_summaries(root_path: str, file_summaries: Dict[str, str]) -> Dict[str, str]`: This is the main function. It takes a dictionary `file_summaries` where keys are relative file paths (e.g., `\"src/api/routes.py\"`) and values are their summaries.\n    - It first organizes file summaries by their parent folder.\n    - For each folder, it combines the summaries of the files within it into a single string.\n    - This combined string is then chunked using `_chunk_text`.\n    - A system instruction is prepared for an LLM, guiding it to summarize the folder's purpose, responsibilities, and its role in the codebase, based on the provided file summaries.\n    - The function then calls `summarize_text_chunks` (imported from `.llm_client`) for each chunk to generate a folder summary.\n    - The function returns a dictionary where keys are folder paths (relative to the root, including an empty string for the root folder itself) and values are their generated summaries.",
    "src\\generate_readme.py": "The python file `generate_readme.py` contains a single function `generate_readme` that takes a dictionary `result` as input and returns a string. This string is formatted as a README.md file.\n\nThe generated README includes:\n- A main heading with the project's base name, derived from `result['project_path']`.\n- An \"Architecture Overview\" section, using the first 500 characters of `result['project_summary']`.\n- An \"Entry Points\" section, listing each entry point from `result['workflow']['entrypoints']` as a formatted list item.\n- A \"Modules by Importance\" section, listing modules from `result['workflow']['top_modules']` with their names and formatted percentages.\n- A \"Security Status\" section, indicating the number of risks detected based on the length of `result['security']['risks']`.\n- A footer stating it was \"Generated by Codebase Workflow Summarizer\".\n\nThe specific structure and content of the `result` dictionary are not fully detailed in this file, but it is expected to contain keys like `project_path`, `project_summary`, `workflow` (with `entrypoints` and `top_modules`), and `security` (with `risks`). The `os` module is imported, and `os.path.basename` is used. The `Dict` type hint is used for the `result` parameter.",
    "src\\llm_client.py": "The `llm_client.py` file provides a function `summarize_text_chunks` for generating a summary of text.\n\nHere's a breakdown of its implementation:\n\n*   **Configuration:** It imports `GEMINI_API_KEY` and `GEMINI_MODEL` from a local `.config` module and uses them to configure the `google.generativeai` library. It then initializes a `genai.GenerativeModel` instance named `_model` using the configured model.\n*   **`summarize_text_chunks` function:**\n    *   Takes a list of `chunks` (strings), a `system_instruction` (string), and optional `filename` and `metadata_text` as input.\n    *   Introduces a fixed delay of 35 seconds using `time.sleep(35)`.\n    *   Joins the input `chunks` into a single string, separated by double newlines (`\\n\\n`).\n    *   Constructs `file_info` string based on the presence of `filename` and `metadata_text`.\n    *   Creates a `prompt` string that includes:\n        *   The `system_instruction`.\n        *   A predefined set of \"Rules\" for the AI, mirroring the rules for this summary generation.\n        *   The generated `file_info`.\n        *   The label \"Here is the content:\" followed by the joined `chunks`.\n        *   The instruction \"Now provide a concise, factual summary.\"\n    *   Calls `_model.generate_content(prompt)` to get a response from the generative model.\n    *   Returns the `response.text` attribute, which is described as the default text field in the current SDK.\n\nThe file does not clearly specify what happens if the `response` object does not have a `text` attribute or if the API call fails.",
    "src\\summarizer.py": "The `summarizer.py` file defines functions for summarizing code files and entire projects.\n\n**Key functions and their implemented behavior:**\n\n*   `_read_file(path: str)`: Reads the content of a file at the given `path` using UTF-8 encoding and ignores errors. It returns the file content as a string or an error message if reading fails.\n*   `_chunk_text(text: str, max_chars: int = MAX_CHARS_PER_CHUNK)`: Splits a given `text` into a list of chunks, where each chunk has a maximum length of `max_chars` (defaulting to 4000).\n*   `_get_file_stats(path: str)`: Retrieves the size in bytes and the number of lines for a file at the given `path`. It handles potential `OSError` for size and general exceptions for line counting.\n*   `summarize_file(path: str)`: Reads a file, gets its statistics, and if the file is not effectively empty (based on content length and line count), it chunks the content and uses `summarize_text_chunks` to generate a summary. The system instruction for this summarization focuses on explaining what is implemented in the file.\n*   `summarize_project(root_path: str)`: This is the main function for summarizing a project. It performs the following steps:\n    1.  **Scans Files:** Uses `list_code_files` to get a list of code file paths within the `root_path`.\n    2.  **Summarizes Files:** Iterates through the detected code files, calls `summarize_file` for each, and stores the summaries in a dictionary keyed by relative file paths.\n    3.  **Aggregates Folders:** Calls `aggregate_folder_summaries` to generate summaries for folders based on the file summaries.\n    4.  **Analyzes Workflow:**\n        *   Reads the content of all code files.\n        *   Detects entry points using `detect_entrypoints`.\n        *   Detects important modules using `detect_important_modules` and selects the top 5.\n        *   Builds a dependency graph using `build_real_dependency_graph`.\n        *   Runs a security scan using `security_scan`.\n    5.  **Generates Project Summary:** Constructs a comprehensive text `project_context_lines` by combining workflow entry points, important modules, folder summaries, and the top 10 file summaries. This context is then chunked and passed to `summarize_text_chunks` with a specific system instruction to summarize the entire codebase, focusing on its purpose, workflow, architecture, and key components.\n    6.  **Returns Results:** Returns a dictionary containing the `project_summary`, `files` summaries, `folders` summaries, `workflow` details (entrypoints, important modules, top modules, dependency graph), and the `security` scan results.\n\nThe code imports functions from `file_scanner`, `llm_client`, `folder_aggregator`, and `workflow_analyzer`, indicating these modules are used for file detection, text summarization via an LLM, folder aggregation, and workflow analysis respectively. It also uses the `os` module for path manipulation and file operations.",
    "src\\workflow_analyzer.py": "The python file `workflow_analyzer.py` contains functions for analyzing code, building dependency graphs, and estimating API costs.\n\nIt defines common patterns for identifying entry points in various languages and for categorizing important modules.\n\nKey functionalities include:\n- `detect_entrypoints`: Identifies files that are likely entry points based on predefined filenames and their extensions.\n- `detect_important_modules`: Scores files based on their filename patterns (e.g., \"models\", \"routes\", \"services\") and their position in the directory structure, assigning higher scores to files in root directories.\n- `parse_python_imports`: Uses Python's `ast` module to parse import statements from Python code, returning a list of imported module names.\n- `parse_js_imports`: Uses regular expressions to extract import paths from JavaScript code.\n- `build_real_dependency_graph`: Constructs a dependency graph by identifying nodes (files) and edges (dependencies) derived from import statements parsed by `parse_python_imports` and `parse_js_imports`. It limits the number of edges returned.\n- `security_scan`: Scans file contents for potential security risks, including secrets (API keys, passwords) and dangerous code patterns like `exec()`, `eval()`, and `subprocess` with `shell=True`. It returns a list of identified risks per file.\n- `predict_api_cost`: Estimates the cost of using an API (like Gemini) based on the number of files and an average file size, calculating estimated input and output tokens and the total cost in USD.",
    "src\\__init__.py": "This file (__init__.py) is effectively empty or contains no meaningful code/content yet (0 lines, 0 bytes)."
  },
  "folders": {
    "": "The ROOT_FOLDER represents the entry point and user interaction layer for a codebase analysis tool. It provides two primary interfaces for users to interact with the tool:\n\n1.  **Command-Line Interface (`cli.py`)**: This script allows users to run the summarization process from the terminal. It takes the project path as a required argument and an optional output file path. It orchestrates the project summarization by calling functions from the `src.summarizer` module and saves the results to a JSON file.\n\n2.  **Web Application (`web_app.py`)**: This script creates a Streamlit-based web interface. It allows users to input a project path, estimate AI API costs, trigger codebase analysis, save results, and download a generated `README.md`. The web app visualizes the analysis results through a tabbed interface, including a project overview, folder structure, and an interactive workflow graph. It relies on `src.file_scanner` and `src.summarizer` for its core functionalities.\n\nIn essence, this folder provides the user-facing components for a project summarization and analysis tool, allowing for both programmatic and interactive usage.",
    "src": "The `src` folder contains the core logic for a codebase summarization tool. Its main responsibilities include:\n\n*   **Configuration Management:** Loading necessary API keys and model names from environment variables.\n*   **Code File Discovery:** Identifying and listing relevant code files within a project, while ignoring specified directories.\n*   **Text Chunking:** Splitting large amounts of text into manageable chunks for processing.\n*   **LLM Interaction:** Summarizing text content, including individual files and aggregated folder information, using a generative AI model.\n*   **File and Folder Summarization:** Reading code files, generating individual file summaries, and then aggregating these into folder summaries.\n*   **Project-Level Analysis:** Orchestrating the summarization of an entire project by scanning files, summarizing them, aggregating folder summaries, analyzing code workflow (entry points, important modules, dependencies), and performing a basic security scan.\n*   **README Generation:** Formatting the aggregated project information into a README.md file.\n*   **Workflow Analysis:** Identifying entry points, important modules, building dependency graphs, and performing security scans within the codebase.\n\nThe `src` folder fits into the overall codebase as the engine that drives the summarization process. It orchestrates calls to various modules (`file_scanner`, `folder_aggregator`, `llm_client`, `workflow_analyzer`) to achieve its goal of producing a comprehensive summary of a project, culminating in a generated README. The `config.py` file provides the necessary external configuration, and the `llm_client.py` file handles the interaction with the generative AI for the actual summarization tasks. The `__init__.py` file is present but currently empty."
  },
  "workflow": {
    "entrypoints": [],
    "important_modules": {
      "cli.py": 0.11111111111111112,
      "web_app.py": 0.11111111111111112,
      "src\\config.py": 1.0,
      "src\\file_scanner.py": 0.11111111111111112,
      "src\\folder_aggregator.py": 0.11111111111111112,
      "src\\generate_readme.py": 0.11111111111111112,
      "src\\llm_client.py": 0.11111111111111112,
      "src\\summarizer.py": 0.11111111111111112,
      "src\\workflow_analyzer.py": 0.11111111111111112,
      "src\\__init__.py": 0.11111111111111112
    },
    "top_modules": [
      [
        "src\\config.py",
        1.0
      ],
      [
        "cli.py",
        0.11111111111111112
      ],
      [
        "web_app.py",
        0.11111111111111112
      ],
      [
        "src\\file_scanner.py",
        0.11111111111111112
      ],
      [
        "src\\folder_aggregator.py",
        0.11111111111111112
      ]
    ],
    "graph": {
      "nodes": [
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\cli.py",
          "label": "cli.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\web_app.py",
          "label": "web_app.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\config.py",
          "label": "config.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\file_scanner.py",
          "label": "file_scanner.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\folder_aggregator.py",
          "label": "folder_aggregator.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\generate_readme.py",
          "label": "generate_readme.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\llm_client.py",
          "label": "llm_client.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\summarizer.py",
          "label": "summarizer.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\workflow_analyzer.py",
          "label": "workflow_analyzer.py",
          "group": "py",
          "size": 15
        },
        {
          "id": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\__init__.py",
          "label": "__init__.py",
          "group": "py",
          "size": 15
        }
      ],
      "edges": [
        {
          "from": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\folder_aggregator.py",
          "to": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\llm_client.py",
          "label": "imports",
          "value": 1
        },
        {
          "from": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\llm_client.py",
          "to": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\config.py",
          "label": "imports",
          "value": 1
        },
        {
          "from": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\summarizer.py",
          "to": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\llm_client.py",
          "label": "imports",
          "value": 1
        },
        {
          "from": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\summarizer.py",
          "to": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\folder_aggregator.py",
          "label": "imports",
          "value": 1
        },
        {
          "from": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\summarizer.py",
          "to": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\workflow_analyzer.py",
          "label": "imports",
          "value": 1
        },
        {
          "from": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\summarizer.py",
          "to": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\file_scanner.py",
          "label": "imports",
          "value": 1
        },
        {
          "from": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\workflow_analyzer.py",
          "to": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\folder_aggregator.py",
          "label": "imports",
          "value": 1
        }
      ]
    }
  },
  "security": {
    "risks": [
      {
        "file": "C:\\Users\\user\\Documents\\Coding\\codebase_summarizer\\src\\workflow_analyzer.py",
        "issues": [
          "⚠️ Dangerous eval/exec detected",
          "⚠️ Shell injection risk"
        ]
      }
    ],
    "total_files_scanned": 10
  }
}